---
kind: enumMember
id: F:Autodesk.Revit.DB.ImportPlacement.Site
enum: Autodesk.Revit.DB.ImportPlacement
source: html/3c54b2eb-2378-c692-4c00-46088b684604.htm
---
# Autodesk.Revit.DB.ImportPlacement.Site

Placement at Base Point. Useful for Revit links only.
 There must be a reference point in order for this option to be valid.